import React from 'react';
import './Answer.css'
const Answer = () => {
    return (
        <div className='answer'>
            <h3>hwo react work</h3>
            <p>
ReactJS হল মোবাইল এবং ওয়েব অ্যাপ্লিকেশন ডেভেলপমেন্টের জন্য সবচেয়ে জনপ্রিয় জাভাস্ক্রিপ্ট লাইব্রেরিগুলির মধ্যে একটি। Facebook দ্বারা তৈরি, React-এ কম্পোনেন্ট নামক ইউজার ইন্টারফেস (UI) বিল্ডিংয়ের জন্য ব্যবহৃত পুনঃব্যবহারযোগ্য জাভাস্ক্রিপ্ট কোড স্নিপেটগুলির একটি সংগ্রহ রয়েছে।

এটা মনে রাখা গুরুত্বপূর্ণ যে ReactJS একটি জাভাস্ক্রিপ্ট ফ্রেমওয়ার্ক নয়। কারণ এটি শুধুমাত্র একটি অ্যাপ্লিকেশনের ভিউ লেয়ারের উপাদান রেন্ডার করার জন্য দায়ী। বেশিরভাগ ফ্রন্ট-এন্ড জাভাস্ক্রিপ্ট ডেভেলপাররা জটিল ফাংশন তৈরি করতে এটিকে কৌণিক এবং Vue-এর মতো ফ্রেমওয়ার্কের সাথে যুক্ত করে।
some time it's fake ui and if i change any thing in ui it's searching all area it's jsut look just wherwe change and 
so the react js is to faste then any other js -libray


</p>
<h3>what is the differnet between props and state</h3>
<p>ডেটা এক উপাদান থেকে অন্য উপাদানে প্রেরণ করা হয়। তথ্য শুধুমাত্র উপাদান মধ্যে পাস করা হয়.
এটি অপরিবর্তনীয় (পরিবর্তন করা যাবে না)। এটি পরিবর্তনযোগ্য (পরিবর্তন করা যেতে পারে)।
রাজ্য এবং কার্যকরী উপাদানগুলির সাথে প্রপস ব্যবহার করা যেতে পারে। স্টেট শুধুমাত্র স্টেট কম্পোনেন্ট/ক্লাস কম্পোনেন্টের সাথে ব্যবহার করা যেতে পারে (16.0 এর আগে)।
প্রপস শুধুমাত্র পঠনযোগ্য. রাষ্ট্র পঠিত এবং লিখিত উভয়.</p>



        </div>
    );
};

export default Answer;